costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
#include "dmesh_module_loader.h"

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>
#include <unistd.h>
#include <fcntl.h>
#include <sys/select.h>

#include "esp_err.h"
#include "esp_flash.h"
#include "esp_timer.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "esp_cache.h"
#include "hal/mmu_hal.h"
#include "hal/mmu_types.h"
#if CONFIG_IDF_TARGET_ESP32
#include "esp_attr.h"
#include "esp_private/cache_utils.h"
#include "esp_private/esp_cache_esp32_private.h"
#include "hal/cache_ll.h"
#include "hal/cache_types.h"
#endif
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_sleep.h"
#include "lwip/inet.h"
#include "lwip/ip4.h"
#include "lwip/sockets.h"
#include "lwip/tcp.h"
#include "lwip/netif.h"
#include "esp_netif.h"
#include "esp_netif_net_stack.h"
#include "dmesh_module_abi.h"
#include "dmesh_flash_abi.h"
#include "dmesh_hw_host.h"

#define MODULE_ALIGN 0x10000u
/* xTaskCreate* takes stack depth in words (4 bytes on ESP32), not bytes.
 * mod_lora's RX loop owns bounded packet/FIFO buffers and invokes the SPI,
 * GPIO, event, and service callbacks from this task. 4096 words was enough
 * for the tiny hello module but left little headroom for the SX126x path.
 * Reserve 16K words (~64 KiB) so future ABI callbacks can grow without
 * coupling the module to Main's stack or heap. */
#define MODULE_TASK_STACK_DEFAULT 16384u
#define MODULE_TASK_STACK_MIN 4096u
#define MODULE_TASK_STACK_MAX 32768u
#define MODULE_TASK_PRIORITY 1u
#define MODULE_MAX_ARGUMENTS 4096u
#define LORA_COMMAND_MAX 128u
#define LORA_SPI_MAX_TRANSFER 272u
#define MODULE_DATA_START 0x3c0000u
#define MODULE_SERVICE_TAG_MIN 43u
#define MODULE_SERVICE_TAG_MAX 100u
#define MODULE_ARENA_SIZE (32u * 1024u)

static bool service_tag_offset(uint16_t service_tag, uint32_t *offset)
{
    if (offset == NULL || service_tag < MODULE_SERVICE_TAG_MIN ||
        service_tag > MODULE_SERVICE_TAG_MAX) return false;
    *offset = ((uint32_t)service_tag - MODULE_SERVICE_TAG_MIN) * MODULE_ALIGN;
    return true;
}

static bool header_service_window(const dmesh_module_header_t *header,
                                  uint16_t service_tag, uint32_t offset,
                                  uint32_t partition_size)
{
    uint32_t expected_offset = 0;
    if (header == NULL || !service_tag_offset(service_tag, &expected_offset) ||
        offset != expected_offset || header->service_tag != service_tag ||
        header->slot_count == 0 || header->image_size < DMESH_MODULE_HEADER_SIZE ||
        header->image_size > (uint32_t)header->slot_count * MODULE_ALIGN ||
        offset > partition_size || header->image_size > partition_size - offset) {
        return false;
    }
    return true;
}

/* The fixed-VMA experiment is deliberately opt-in through the DMOD header.
 * These windows are in the instruction linear region but well above the
 * normal application image. The module build links its code at
 * WINDOW + DMESH_MODULE_HEADER_SIZE; the mapped page still starts at the
 * 64-KiB-aligned module slot so the header and code share an aligned MMU
 * window. The window may span multiple 64 KiB pages. */
#if CONFIG_IDF_TARGET_ESP32S3
#define MODULE_FIXED_VADDR 0x43000000u
#define MODULE_FIXED_DATA_VADDR 0x3d000000u
/* Modules are mapped in whole 64-KiB MMU pages.  mod_lora is currently
 * slightly larger than two pages, so reserve four pages rather than making
 * an otherwise valid image fail before its entry point is reached. */
#define MODULE_FIXED_WINDOW_SIZE 0x40000u
#elif CONFIG_IDF_TARGET_ESP32
#define MODULE_FIXED_VADDR 0x40300000u
#define MODULE_FIXED_DATA_VADDR 0x3f700000u
#define MODULE_FIXED_WINDOW_SIZE 0x20000u
#endif

#if defined(MODULE_FIXED_VADDR)
_Static_assert((MODULE_FIXED_VADDR % 0x10000u) == 0, "module code alias must be MMU aligned");
_Static_assert((MODULE_FIXED_DATA_VADDR % 0x10000u) == 0, "module data alias must be MMU aligned");
_Static_assert(MODULE_FIXED_WINDOW_SIZE % 0x10000u == 0, "module window must be MMU-page aligned");
#if CONFIG_IDF_TARGET_ESP32
/* Main's classic ESP32 IROM begins at 0x400d0000. Keep the dynamic module
 * window above the application image rather than replacing Main's code. */
_Static_assert(MODULE_FIXED_VADDR >= 0x40300000u, "classic module alias overlaps Main IROM");
_Static_assert(MODULE_FIXED_DATA_VADDR >= 0x3f700000u, "classic module alias overlaps Main DROM");
#endif
#endif

static const char *TAG = "dmesh-module";

uint8_t dmesh_module_loader_ip_netif_flags(void *esp_netif)
{
    if (esp_netif == NULL) return 0;
    struct netif *netif = (struct netif *)esp_netif_get_netif_impl(esp_netif);
    return netif == NULL ? 0 : netif->flags;
}




uint8_t dmesh_module_loader_ip_netif_default(void *esp_netif)
{
    if (esp_netif == NULL) return 0;
    struct netif *netif = (struct netif *)esp_netif_get_netif_impl(esp_netif);
    return netif != NULL && netif_default == netif;
}

uint8_t dmesh_module_loader_ip_netif_io_state(void *esp_netif)
{
    if (esp_netif == NULL) return 0;
    struct netif *netif = (struct netif *)esp_netif_get_netif_impl(esp_netif);
    if (netif == NULL) return 0;
    uint8_t result = 0;
    if (netif->output != NULL) result |= 1u;
    if (netif->linkoutput != NULL) result |= 2u;
    if (netif->state != NULL) result |= 4u;
    if (netif->hwaddr_len != 0) result |= 8u;
    return result;
}

uint32_t dmesh_module_loader_ip_netif_addr(void *esp_netif, uint8_t which)
{
    if (esp_netif == NULL) return 0;
    struct netif *netif = (struct netif *)esp_netif_get_netif_impl(esp_netif);
    if (netif == NULL) return 0;
    if (which == 0) return netif->ip_addr.u_addr.ip4.addr;
    if (which == 1) return netif->netmask.u_addr.ip4.addr;
    if (which == 2) return netif->gw.u_addr.ip4.addr;
    return 0;
}


static dmesh_module_header_t cached_header;
static uint32_t cached_offset;
static esp_partition_t cached_raw_partition;
static const esp_partition_t *cached_partition;
static bool cached_header_valid;
static volatile bool cached_task_done;
static volatile bool cached_task_running;
static volatile uint64_t running_service_mask;
static volatile int cached_last_result = -999;
static volatile uint32_t cached_task_start_ms;
static volatile uint32_t cached_last_runtime_ms;
static volatile uint32_t cached_max_runtime_ms;
static volatile uint32_t cached_task_runs;
static volatile uint32_t cached_last_stack_high_water_words;
/* Main discards ESP_LOG output in normal operation; expose coarse diagnostic
 * state through module status instead. */
static volatile uint32_t cached_task_stage;
static volatile uint32_t cached_spi_calls;
static volatile uint32_t cached_spi_errors;
static volatile uint32_t cached_lora_poll_count;
static volatile uint32_t cached_lora_irq_wakes;
static volatile uint32_t cached_lora_irq_timeouts;
static volatile uint32_t cached_last_lora_payload_len;
static volatile uint32_t cached_last_lora_command_len;
static volatile uint32_t cached_module_event_calls;
static volatile uint32_t cached_last_module_event_id;
static volatile uint32_t cached_entry_args_len;
static volatile uint32_t cached_flash_connect_attempts;
static volatile int32_t cached_flash_connect_errno;
static volatile uint16_t cached_flash_connect_port;
static char cached_flash_connect_host[16];
static char cached_entry_args[16];
static char cached_last_lora_command[16];
static TaskHandle_t cached_task_handle;
static char cached_task_name[16];
static volatile uint16_t cached_task_service_tag;
static portMUX_TYPE lora_command_mux = portMUX_INITIALIZER_UNLOCKED;

