costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
/* Main-owned transient memory map for module calls. The arena is reset before
 * each entry invocation and after it returns; modules must not retain these
 * pointers across calls or task restarts. */
static uint8_t module_arena[MODULE_ARENA_SIZE] __attribute__((aligned(16)));
static size_t module_arena_used;

static void module_arena_reset(void)
{
    module_arena_used = 0;
}

static void *module_alloc(void *user, size_t size, size_t align)
{
    (void)user;
    if (size == 0 || align == 0 || (align & (align - 1u)) != 0) return NULL;
    uintptr_t base = (uintptr_t)module_arena;
    uintptr_t current = base + module_arena_used;
    uintptr_t aligned = (current + align - 1u) & ~(align - 1u);
    if (aligned < current || aligned < base || aligned - base > MODULE_ARENA_SIZE ||
        size > MODULE_ARENA_SIZE - (size_t)(aligned - base)) return NULL;
    module_arena_used = (size_t)(aligned - base) + size;
    return (void *)aligned;
}

static bool service_running(uint16_t service_tag)
{
    if (service_tag < MODULE_SERVICE_TAG_MIN || service_tag > MODULE_SERVICE_TAG_MAX) return false;
    return (running_service_mask & (UINT64_C(1) << (service_tag - MODULE_SERVICE_TAG_MIN))) != 0;
}

static void service_set_running(uint16_t service_tag, bool running)
{
    if (service_tag < MODULE_SERVICE_TAG_MIN || service_tag > MODULE_SERVICE_TAG_MAX) return;
    uint64_t bit = UINT64_C(1) << (service_tag - MODULE_SERVICE_TAG_MIN);
    portENTER_CRITICAL(&lora_command_mux);
    if (running) running_service_mask |= bit;
    else running_service_mask &= ~bit;
    cached_task_running = running_service_mask != 0;
    portEXIT_CRITICAL(&lora_command_mux);
}
static spi_device_handle_t lora_spi;
static dmesh_lora_config_v1 lora_config = {
    .abi_version = DMESH_LORA_ABI_VERSION, .size = sizeof(dmesh_lora_config_v1),
    .spi_host = 2,
    .chip = DMESH_LORA_CHIP_SX127X, .reset_pin = 14, .cs_pin = 18,
    .irq_pin = 26, .busy_pin = -1, .sck_pin = 5, .miso_pin = 19, .mosi_pin = 27,
    .board_power_pin = -1, .board_power_level = 1,
    .sx1262_dio2_rf_switch = 0, .sx1262_tcxo_mv = 0,
    .sx1262_pa_duty = 4, .sx1262_pa_hp = 7,
    .sx1262_pa_device = 0, .sx1262_pa_lut = 1,
    .sx1262_sync_word = 0x24b4, .sx1262_rx_timeout_ms = 0,
    .coding_rate = 5, .preamble = 16, .crc = 1,
};

static spi_host_device_t lora_spi_host_device(void)
{
#if CONFIG_IDF_TARGET_ESP32C6
    /* C6 has no SPI3_HOST; map both persisted host values to SPI2. */
    return SPI2_HOST;
#else
    return lora_config.spi_host == 1 ? SPI2_HOST : SPI3_HOST;
#endif
}
static uint8_t lora_command_args[LORA_COMMAND_MAX];
static uint8_t lora_command_payload[DMESH_LORA_MAX_PACKET];
static size_t lora_command_args_len;
static size_t lora_command_payload_len;
static bool lora_command_pending;
static int log_line(void *user, const uint8_t *data, size_t len);

#if defined(MODULE_FIXED_VADDR)
static uint32_t module_mmu_id(void)
{
#if SOC_MMU_PER_EXT_MEM_TARGET
    return mmu_hal_get_id_from_target(MMU_TARGET_FLASH0);
#else
    /* ESP32/ESP32-S3 use the shared flash MMU table.  The ID is fixed at
     * zero; mmu_hal_get_id_from_target() is not declared by those targets. */
    return 0;
#endif
}

#if CONFIG_IDF_TARGET_ESP32
/* IDF's public esp_mmu_map() has safe cache handling, but does not accept a
 * caller-selected virtual address.  Keep the fixed-VMA experiment safe by
 * reproducing its small IRAM mapping critical section here.  Every operation
 * while caches are stopped is either IRAM or an inline HAL primitive. */
static IRAM_ATTR NOINLINE_ATTR void map_fixed_aliases_esp32(
    uint32_t paddr, uint32_t len, uint32_t code_vaddr, uint32_t data_vaddr,
    uint32_t *code_len, uint32_t *data_len)
{
    const uint32_t page_size = mmu_hal_pages_to_bytes(0, 1);
    uint32_t mapped = 0;
    spi_flash_disable_interrupts_caches_and_other_cpu();
    mmu_hal_map_region(0, MMU_TARGET_FLASH0, code_vaddr, paddr,
                       len, &mapped);
#if !CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE
    mmu_hal_map_region(1, MMU_TARGET_FLASH0, code_vaddr, paddr,
                       len, &mapped);
#endif
    *code_len = mapped;
    mmu_hal_map_region(0, MMU_TARGET_FLASH0, data_vaddr, paddr,
                       len, &mapped);
#if !CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE
    mmu_hal_map_region(1, MMU_TARGET_FLASH0, data_vaddr, paddr,
                       len, &mapped);
#endif
    *data_len = mapped;
    cache_bus_mask_t buses = cache_ll_l1_get_bus(0, code_vaddr, len);
    buses |= cache_ll_l1_get_bus(0, data_vaddr, len);
    cache_ll_l1_enable_bus(0, buses);
#if !CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE
    cache_ll_l1_enable_bus(1, buses);
#endif
    cache_sync();
    spi_flash_enable_interrupts_caches_and_other_cpu();
    (void)page_size;
}
#endif

static esp_err_t map_fixed_module(const esp_partition_t *partition, uint32_t offset,
                                  uint32_t image_size, const uint8_t **out_base,
                                  uint32_t *out_mapped_size, uint32_t code_vaddr,
                                  uint32_t data_vaddr)
{
    if (partition == NULL || out_base == NULL || out_mapped_size == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (offset > partition->size || image_size == 0 ||
        image_size > partition->size - offset ||
        offset % MODULE_ALIGN != 0 || partition->address > UINT32_MAX - offset) {
        ESP_LOGE(TAG, "fixed module source rejected address=0x%08lx offset=0x%08lx partition=0x%08lx image=0x%08lx",
                 (unsigned long)partition->address, (unsigned long)offset,
                 (unsigned long)partition->size, (unsigned long)image_size);
        return ESP_ERR_INVALID_ARG;
    }
    const uint32_t paddr = partition->address + offset;
    const uint32_t mmu_id = module_mmu_id();
    const uint32_t page_size = mmu_hal_pages_to_bytes(mmu_id, 1);
    if (page_size == 0 || (code_vaddr % page_size) != 0 ||
        (data_vaddr % page_size) != 0 ||
        code_vaddr > UINT32_MAX - MODULE_FIXED_WINDOW_SIZE ||
        data_vaddr > UINT32_MAX - MODULE_FIXED_WINDOW_SIZE ||
        (code_vaddr < data_vaddr + MODULE_FIXED_WINDOW_SIZE &&
         data_vaddr < code_vaddr + MODULE_FIXED_WINDOW_SIZE) ||
        (paddr % page_size) != 0 || image_size > MODULE_FIXED_WINDOW_SIZE) {
        ESP_LOGE(TAG, "fixed module window rejected code=0x%08lx data=0x%08lx page=0x%08lx image=0x%08lx",
                 (unsigned long)code_vaddr, (unsigned long)data_vaddr,
                 (unsigned long)page_size, (unsigned long)image_size);
        return ESP_ERR_INVALID_ARG;
    }
    ESP_LOGI(TAG, "fixed module window 128k code=0x%08lx data=0x%08lx page=0x%08lx image=0x%08lx",
             (unsigned long)code_vaddr, (unsigned long)data_vaddr,
             (unsigned long)page_size, (unsigned long)image_size);
    uint32_t mapped_size = 0;
    const uint32_t rounded_size =
        ((image_size + page_size - 1u) / page_size) * page_size;
    if (rounded_size == 0 || rounded_size > MODULE_FIXED_WINDOW_SIZE ||
        code_vaddr > UINT32_MAX - rounded_size ||
        data_vaddr > UINT32_MAX - rounded_size) {
        ESP_LOGE(TAG, "fixed module mapping size rejected rounded=0x%08lx window=0x%08x",
                 (unsigned long)rounded_size, MODULE_FIXED_WINDOW_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
#if CONFIG_IDF_TARGET_ESP32
    uint32_t data_mapped_size = 0;
    map_fixed_aliases_esp32(paddr, image_size, code_vaddr, data_vaddr,
                            &mapped_size, &data_mapped_size);
#else
    mmu_hal_map_region(mmu_id, MMU_TARGET_FLASH0, code_vaddr, paddr,
                       image_size, &mapped_size);
#endif
    if (mapped_size < rounded_size || mapped_size > MODULE_FIXED_WINDOW_SIZE) {
        ESP_LOGE(TAG, "fixed code mapping incomplete requested=0x%08lx mapped=0x%08lx",
                 (unsigned long)rounded_size, (unsigned long)mapped_size);
        mmu_hal_unmap_region(mmu_id, code_vaddr, mapped_size);
        return ESP_FAIL;
    }
    /* Xtensa literals and Rust string constants are ordinary data loads. The
     * code and data buses have different virtual aliases, so map the same
     * contiguous flash image into both. MODULE_DATA_VMA in the fixed linker
     * script points .rodata at this corresponding data-bus window. */
#if !CONFIG_IDF_TARGET_ESP32
    uint32_t data_mapped_size = 0;
    mmu_hal_map_region(mmu_id, MMU_TARGET_FLASH0, data_vaddr, paddr,
                       image_size, &data_mapped_size);
#endif
    if (data_mapped_size < rounded_size || data_mapped_size > MODULE_FIXED_WINDOW_SIZE) {
        ESP_LOGE(TAG, "fixed data mapping incomplete requested=0x%08lx mapped=0x%08lx",
                 (unsigned long)rounded_size, (unsigned long)data_mapped_size);
        mmu_hal_unmap_region(mmu_id, code_vaddr, mapped_size);
        mmu_hal_unmap_region(mmu_id, data_vaddr, data_mapped_size);
        return ESP_FAIL;
    }
    /* The HAL only changes MMU entries. Invalidate both caches so a previous
     * module occupying either alias cannot be executed/read accidentally. */
    esp_err_t sync_err = ESP_OK;
#if !CONFIG_IDF_TARGET_ESP32
    sync_err = esp_cache_msync((void *)code_vaddr, mapped_size,
                               ESP_CACHE_MSYNC_FLAG_DIR_M2C |
                               ESP_CACHE_MSYNC_FLAG_TYPE_INST);
    if (sync_err == ESP_OK) {
        sync_err = esp_cache_msync((void *)data_vaddr, data_mapped_size,
                                   ESP_CACHE_MSYNC_FLAG_DIR_M2C |
                                   ESP_CACHE_MSYNC_FLAG_TYPE_DATA);
    }
#endif
    if (sync_err != ESP_OK) {
        mmu_hal_unmap_region(mmu_id, code_vaddr, mapped_size);
        mmu_hal_unmap_region(mmu_id, data_vaddr, data_mapped_size);
        return sync_err;
    }
    *out_base = (const uint8_t *)(uintptr_t)code_vaddr;
    *out_mapped_size = mapped_size;
    return ESP_OK;
}

static void unmap_fixed_module(uint32_t mapped_size, uint32_t code_vaddr, uint32_t data_vaddr)
{
    if (mapped_size == 0) return;
    const uint32_t mmu_id = module_mmu_id();
    mmu_hal_unmap_region(mmu_id, code_vaddr, mapped_size);
    mmu_hal_unmap_region(mmu_id, data_vaddr, mapped_size);
}
#endif

/* Read the small fixed header through the flash MMU. The synthetic raw data
 * partition is intentionally not passed through esp_partition_read here:
 * header probes are part of the command path and must not wait on a blocking
 * flash-driver transaction. */
static esp_err_t read_module_header(const esp_partition_t *partition, uint32_t offset,
                                    dmesh_module_header_t *header)
{
    if (partition == NULL || header == NULL || offset > partition->size ||
        partition->size - offset < sizeof(*header)) return ESP_ERR_INVALID_ARG;
    const void *mapped = NULL;
    esp_partition_mmap_handle_t handle = 0;
    esp_err_t err = esp_partition_mmap(partition, offset, sizeof(*header),
                                       ESP_PARTITION_MMAP_DATA, &mapped, &handle);
    if (err != ESP_OK || mapped == NULL) return err != ESP_OK ? err : ESP_FAIL;
    memcpy(header, mapped, sizeof(*header));
    esp_partition_munmap(handle);
    return ESP_OK;
}
extern void dmesh_lora_irq_set_task(void *task);
extern void dmesh_lora_irq_rearm(void);
extern void dmesh_lora_gpio_isr(void *arg);
extern int dmesh_module_call_service(uint16_t service_tag,
                                     const uint8_t *payload, size_t payload_len,
                                     uint8_t *response, size_t response_capacity,
                                     size_t *response_len, uint32_t timeout_ms);
extern int dmesh_module_get_setting(const uint8_t *key, size_t key_len,
                                    uint8_t *value, size_t value_capacity,
                                    size_t *value_len);
extern int dmesh_module_set_setting(const uint8_t *key, size_t key_len,
                                    const uint8_t *value, size_t value_len);
extern int dmesh_module_emit_event(uint16_t event_id, uint8_t value_type, uint8_t flags,
                                   const uint8_t *payload, size_t payload_len);

