costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
static int get_setting(void *user, const uint8_t *key, size_t key_len,
                       uint8_t *value, size_t value_capacity, size_t *value_len)
{
    (void)user;
    return dmesh_module_get_setting(key, key_len, value, value_capacity, value_len);
}
static int set_setting(void *user, const uint8_t *key, size_t key_len,
                       const uint8_t *value, size_t value_len)
{
    (void)user;
    return dmesh_module_set_setting(key, key_len, value, value_len);
}
static int emit_event(void *user, const dmesh_module_event_v1 *event)
{
    (void)user;
    if (event == NULL) return -1;
    cached_module_event_calls++;
    cached_last_module_event_id = event->event_id;
    return dmesh_module_emit_event(event->event_id, event->value_type, event->flags,
                                   event->value, event->value_len);
}

static int lora_spi_transfer(void *user, const uint8_t *tx, uint8_t *rx, size_t len)
{
    (void)user;
    cached_spi_calls++;
    cached_task_stage = 6;
    /* SX126x reads include opcode/address/status bytes around a 255-byte
     * packet, so the SPI transaction is larger than the radio payload. */
    if (lora_spi == NULL || tx == NULL || rx == NULL || len == 0 || len > LORA_SPI_MAX_TRANSFER) {
        cached_spi_errors++;
        return -1;
    }
    /* SX126x holds BUSY high while a command is being processed. Waiting in
     * the module's dedicated task keeps this host primitive synchronous and
     * prevents a command from being clocked into the radio too early. The
     * timeout is finite so a missing/stuck BUSY signal cannot wedge Main. */
    if (lora_config.busy_pin >= 0) {
        const TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(100);
        while (gpio_get_level((gpio_num_t)lora_config.busy_pin) != 0) {
            if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) {
                cached_spi_errors++;
                return DMESH_LORA_ERR_BUSY;
            }
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
    spi_transaction_t t = {0};
    t.length = len * 8;
    t.tx_buffer = tx;
    t.rx_buffer = rx;
    /* Do not use spi_device_transmit here: a module must never be able to
     * wedge Main indefinitely on a claimed bus or missing radio. Queue the
     * transaction and bound both queueing and completion waits. */
    const TickType_t spi_timeout = pdMS_TO_TICKS(100);
    esp_err_t spi_err = spi_device_queue_trans(lora_spi, &t, spi_timeout);
    if (spi_err != ESP_OK) {
        cached_spi_errors++;
        return -1;
    }
    spi_transaction_t *completed = NULL;
    spi_err = spi_device_get_trans_result(lora_spi, &completed, spi_timeout);
    if (spi_err != ESP_OK || completed != &t) {
        ESP_LOGE(TAG, "module SPI complete failed err=%s completed=%p expected=%p",
                 esp_err_to_name(spi_err), (void *)completed, (void *)&t);
        cached_spi_errors++;
        return -1;
    }
    /* SX126x commands are not complete when CS rises: the chip keeps BUSY
     * asserted while it applies the command. The former Main driver waited
     * after every transaction; without this wait a following GET_IRQ_STATUS
     * can race SET_TX and observe zero IRQ bits. Keep the bound finite so a
     * dead radio cannot wedge the module task. */
    if (lora_config.busy_pin >= 0) {
        const TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(100);
        while (gpio_get_level((gpio_num_t)lora_config.busy_pin) != 0) {
            if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) {
                cached_spi_errors++;
                return DMESH_LORA_ERR_BUSY;
            }
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
    cached_task_stage = 7;
    return 0;
}

static int lora_gpio_write(void *user, int pin, int level)
{ (void)user; return gpio_set_level((gpio_num_t)pin, level) == ESP_OK ? 0 : -1; }
static int lora_gpio_read(void *user, int pin)
{ (void)user; return gpio_get_level((gpio_num_t)pin); }
static int lora_irq_configure(void *user, int pin, int active_level)
{
    (void)user;
    if (pin < 0 || pin > 48) return -1;
    esp_err_t err = gpio_set_direction((gpio_num_t)pin, GPIO_MODE_INPUT);
    if (err != ESP_OK) return -1;
    err = gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) return -1;
    /* Reconfiguration is also the module stop operation. Do not leave an
     * ISR or a light-sleep wake source attached to a radio being upgraded. */
    (void)gpio_intr_disable((gpio_num_t)pin);
    (void)gpio_isr_handler_remove((gpio_num_t)pin);
    (void)gpio_wakeup_disable((gpio_num_t)pin);
    if (active_level == 0) return 0;
    if (gpio_set_intr_type((gpio_num_t)pin, GPIO_INTR_POSEDGE) != ESP_OK) return -1;
    err = gpio_isr_handler_add((gpio_num_t)pin, dmesh_lora_gpio_isr,
                               (void *)(uintptr_t)pin);
    if (err != ESP_OK) return -1;
    /* The edge ISR wakes the module task while awake. The level wake source
     * is what brings an ESP32 out of automatic light sleep when DIO0 goes
     * high; the task clears the radio IRQ before re-enabling the GPIO edge. */
    if (gpio_wakeup_enable((gpio_num_t)pin, GPIO_INTR_HIGH_LEVEL) != ESP_OK) {
        (void)gpio_isr_handler_remove((gpio_num_t)pin);
        return -1;
    }
    if (esp_sleep_enable_gpio_wakeup() != ESP_OK) {
        (void)gpio_wakeup_disable((gpio_num_t)pin);
        (void)gpio_isr_handler_remove((gpio_num_t)pin);
        return -1;
    }
    return 0;
}
static int lora_irq_enable(void *user, int pin, int enabled)
{
    (void)user;
    if (pin < 0 || pin > 48) return -1;
    if (enabled) {
        if (gpio_wakeup_enable((gpio_num_t)pin, GPIO_INTR_HIGH_LEVEL) != ESP_OK) return -1;
        if (esp_sleep_enable_gpio_wakeup() != ESP_OK) return -1;
        return gpio_intr_enable((gpio_num_t)pin) == ESP_OK ? 0 : -1;
    }
    (void)gpio_wakeup_disable((gpio_num_t)pin);
    return gpio_intr_disable((gpio_num_t)pin) == ESP_OK ? 0 : -1;
}
static int lora_wait_irq(void *user, uint32_t timeout_ms)
{
    (void)user;
    if (timeout_ms > 1000u) timeout_ms = 1000u;
    dmesh_lora_irq_rearm();
    TickType_t ticks = pdMS_TO_TICKS(timeout_ms);
    /* On the 10 ms tick configuration, a 5 ms module poll otherwise rounds
     * to zero and becomes a busy loop. Always yield for at least one tick. */
    if (timeout_ms != 0 && ticks == 0) ticks = 1;
    if (ulTaskGenericNotifyTake(0, pdTRUE, ticks) != 0) {
        cached_lora_irq_wakes++;
        return 0;
    }
    cached_lora_irq_timeouts++;
    return 1;
}
static uint64_t lora_now_ms(void *user)
{ (void)user; return (uint64_t)(xTaskGetTickCount() * portTICK_PERIOD_MS); }
static int lora_emit_packet(void *user, const uint8_t *data, size_t len, int16_t rssi, int8_t snr)
{
    (void)user;
    if (data == NULL || len == 0 || len > DMESH_LORA_MAX_PACKET) return -1;
    char args[64];
    int args_len = snprintf(args, sizeof(args), "op=lora_rx rssi=%d snr=%d", rssi, snr);
    if (args_len <= 0 || (size_t)args_len >= sizeof(args)) return -1;
    (void)args;
    return dmesh_module_call_service(101u, data, len, NULL, 0, NULL, 50);
}
static int lora_poll_command(void *user, uint8_t *args, size_t *args_len,
                             uint8_t *payload, size_t *payload_len)
{
    (void)user;
    if (args == NULL || args_len == NULL || payload == NULL || payload_len == NULL) return -1;
    portENTER_CRITICAL(&lora_command_mux);
    if (!lora_command_pending) {
        portEXIT_CRITICAL(&lora_command_mux);
        return -1;
    }
    if (*args_len < lora_command_args_len || *payload_len < lora_command_payload_len) {
        portEXIT_CRITICAL(&lora_command_mux);
        return -2;
    }
    memcpy(args, lora_command_args, lora_command_args_len);
    memcpy(payload, lora_command_payload, lora_command_payload_len);
    cached_lora_poll_count++;
    cached_last_lora_payload_len = (uint32_t)lora_command_payload_len;
    cached_last_lora_command_len = (uint32_t)lora_command_args_len;
    memset(cached_last_lora_command, 0, sizeof(cached_last_lora_command));
    size_t command_copy = lora_command_args_len < sizeof(cached_last_lora_command) - 1u
        ? lora_command_args_len : sizeof(cached_last_lora_command) - 1u;
    memcpy(cached_last_lora_command, lora_command_args, command_copy);
    *args_len = lora_command_args_len;
    *payload_len = lora_command_payload_len;
    lora_command_pending = false;
    portEXIT_CRITICAL(&lora_command_mux);
    return 0;
}

static dmesh_lora_host_v1 lora_host = {
    .abi_version = DMESH_LORA_ABI_VERSION,
    .size = sizeof(dmesh_lora_host_v1),
    .features = 0,
    .user = NULL,
    .spi_transfer = lora_spi_transfer,
    .gpio_write = lora_gpio_write,
    .gpio_read = lora_gpio_read,
    .irq_configure = lora_irq_configure,
    .irq_enable = lora_irq_enable,
    .wait_irq = lora_wait_irq,
    .now_ms = lora_now_ms,
    .log_line = log_line,
    .emit_packet = lora_emit_packet,
    .poll_command = lora_poll_command,
};

static void lora_host_init(void)
{
    if (lora_config.board_power_pin >= 0) {
        gpio_num_t power = (gpio_num_t)lora_config.board_power_pin;
        (void)gpio_reset_pin(power);
        (void)gpio_set_direction(power, GPIO_MODE_OUTPUT);
        (void)gpio_set_level(power, lora_config.board_power_level != 0 ? 1 : 0);
        /* Give an externally powered radio/TCXO a bounded settling interval
         * before asserting its reset line. */
        vTaskDelay(pdMS_TO_TICKS(2));
    }
    if (lora_config.busy_pin >= 0) {
        gpio_num_t busy = (gpio_num_t)lora_config.busy_pin;
        (void)gpio_reset_pin(busy);
        (void)gpio_set_direction(busy, GPIO_MODE_INPUT);
    }
    if (lora_config.reset_pin >= 0) {
        gpio_num_t reset = (gpio_num_t)lora_config.reset_pin;
        (void)gpio_reset_pin(reset);
        (void)gpio_set_direction(reset, GPIO_MODE_OUTPUT);
        (void)gpio_set_level(reset, 0);
        vTaskDelay(pdMS_TO_TICKS(10));
        (void)gpio_set_level(reset, 1);
        vTaskDelay(pdMS_TO_TICKS(20));
        if (lora_config.busy_pin >= 0) {
            const TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(500);
            while (gpio_get_level((gpio_num_t)lora_config.busy_pin) != 0) {
                if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) break;
                vTaskDelay(pdMS_TO_TICKS(1));
            }
        }
    }
    if (lora_spi != NULL) return;
    /* Match Main's persisted ESP host enum: 1=SPI2/HSPI, 2=SPI3/VSPI. */
    spi_host_device_t host = lora_spi_host_device();
    spi_bus_config_t bus = {
        .mosi_io_num = lora_config.mosi_pin >= 0 ? lora_config.mosi_pin :
                       (lora_config.spi_host == 1 ? 10 : 27),
        .miso_io_num = lora_config.miso_pin >= 0 ? lora_config.miso_pin :
                       (lora_config.spi_host == 1 ? 11 : 19),
        .sclk_io_num = lora_config.sck_pin >= 0 ? lora_config.sck_pin :
                       (lora_config.spi_host == 1 ? 9 : 5),
        .quadwp_io_num = -1, .quadhd_io_num = -1, .max_transfer_sz = LORA_SPI_MAX_TRANSFER,
    };
    esp_err_t bus_err = spi_bus_initialize(host, &bus, SPI_DMA_CH_AUTO);
    bool bus_owned = bus_err == ESP_OK;
    if (bus_err != ESP_OK && bus_err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "LoRa SPI bus init failed host=%d err=%s pins=%d/%d/%d",
                 (int)host, esp_err_to_name(bus_err), bus.mosi_io_num,
                 bus.miso_io_num, bus.sclk_io_num);
        return;
    }
    spi_device_interface_config_t dev = {
        .clock_speed_hz = 1000000, .mode = 0,
        .spics_io_num = lora_config.cs_pin >= 0 ? lora_config.cs_pin :
                        (lora_config.spi_host == 2 ? 8 : 18), .queue_size = 1,
    };
    esp_err_t device_err = spi_bus_add_device(host, &dev, &lora_spi);
    if (device_err != ESP_OK || lora_spi == NULL) {
        ESP_LOGE(TAG, "LoRa SPI device add failed host=%d err=%s cs=%d bus_err=%s",
                 (int)host, esp_err_to_name(device_err), dev.spics_io_num,
                 esp_err_to_name(bus_err));
        lora_spi = NULL;
        if (bus_owned) (void)spi_bus_free(host);
    } else {
        ESP_LOGI(TAG, "LoRa SPI ready host=%d cs=%d pins=%d/%d/%d max_transfer=%u",
                 (int)host, dev.spics_io_num, bus.mosi_io_num, bus.miso_io_num,
                 bus.sclk_io_num, (unsigned)LORA_SPI_MAX_TRANSFER);
    }
}


static const esp_partition_t *resolve_module_partition(void)
{
    const esp_partition_t *partition = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "data");
    /* Current Rust fleet tables call the flash-backed blob store
     * `dmesh_store`; Recovery's module target deliberately aliases this
     * partition. Keep the legacy `data` name first for early boards. */
    if (partition == NULL) {
        partition = esp_partition_find_first(
            ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "dmesh_store");
    }
    if (partition != NULL) {
        /* The raw data/module region is intentionally the tail of flash. A
         * legacy table may describe only its first 256 KiB; extend the local
         * view to the detected physical end so module placement matches the
         * Recovery protocol on larger chips. */
        uint32_t flash_size = 0;
        if (esp_flash_get_physical_size(esp_flash_default_chip, &flash_size) == ESP_OK &&
            flash_size > partition->address &&
            partition->address + partition->size < flash_size) {
            cached_raw_partition = *partition;
            cached_raw_partition.size = flash_size - partition->address;
            cached_partition = &cached_raw_partition;
            return cached_partition;
        }
        return partition;
    }
    uint32_t flash_size = 0;
    if (esp_flash_get_physical_size(esp_flash_default_chip, &flash_size) != ESP_OK ||
        flash_size <= MODULE_DATA_START) return NULL;
    memset(&cached_raw_partition, 0, sizeof(cached_raw_partition));
    cached_raw_partition.flash_chip = esp_flash_default_chip;
    cached_raw_partition.type = ESP_PARTITION_TYPE_DATA;
    cached_raw_partition.subtype = ESP_PARTITION_SUBTYPE_ANY;
    cached_raw_partition.address = MODULE_DATA_START;
    cached_raw_partition.size = flash_size - MODULE_DATA_START;
    cached_raw_partition.erase_size = 0x1000;
    cached_partition = &cached_raw_partition;
    return cached_partition;
}

void dmesh_module_loader_init(void)
{
    ESP_LOGI(TAG, "startup init enter");
    dmesh_hw_host_set_spi(lora_spi_transfer);
    dmesh_hw_host_reset();
    cached_header_valid = false;
    cached_offset = 0;
    cached_task_done = false;
    cached_task_running = false;
    running_service_mask = 0;
    cached_last_result = -999;
    cached_task_start_ms = 0;
    cached_last_runtime_ms = 0;
    cached_max_runtime_ms = 0;
    cached_task_runs = 0;
    cached_last_stack_high_water_words = 0;
    cached_lora_poll_count = 0;
    cached_last_lora_payload_len = 0;
    cached_last_lora_command_len = 0;
    cached_module_event_calls = 0;
    cached_last_module_event_id = 0;
    cached_entry_args_len = 0;
    memset(cached_entry_args, 0, sizeof(cached_entry_args));
    memset(cached_last_lora_command, 0, sizeof(cached_last_lora_command));
    cached_task_handle = NULL;
    memset(cached_task_name, 0, sizeof(cached_task_name));
    cached_task_service_tag = 0;
    cached_partition = resolve_module_partition();
    if (cached_partition == NULL || cached_partition->size < DMESH_MODULE_HEADER_SIZE) {
        ESP_LOGW(TAG, "module header unavailable partition=%p", (void *)cached_partition);
        return;
    }
    ESP_LOGI(TAG, "startup partition address=0x%08lx size=0x%08lx",
             (unsigned long)cached_partition->address,
             (unsigned long)cached_partition->size);
    /* The first experiment uses one deterministic slot. Do not scan the
     * extended raw data region from a command handler; later index/compaction
     * work can add discovery without changing explicit offset invocation. */
    const uint32_t offset = 0;
    dmesh_module_header_t candidate;
    if (read_module_header(cached_partition, offset, &candidate) == ESP_OK &&
        candidate.magic == DMESH_MODULE_MAGIC &&
        candidate.abi_version == DMESH_MODULE_ABI_VERSION &&
        candidate.header_size == DMESH_MODULE_HEADER_SIZE &&
        candidate.entry_offset >= DMESH_MODULE_HEADER_SIZE &&
        candidate.entry_offset % 4u == 0 &&
        candidate.entry_offset < candidate.image_size &&
        candidate.image_size <= cached_partition->size - offset) {
        cached_header = candidate;
        cached_offset = offset;
        cached_header_valid = true;
    }
    ESP_LOGI(TAG, "startup header valid=%s tag=%u offset=0x%08lx entry=0x%08lx image=0x%08lx",
             cached_header_valid ? "true" : "false", (unsigned long)cached_offset,
             (unsigned)cached_header.service_tag,
             (unsigned long)cached_header.entry_offset,
             (unsigned long)cached_header.image_size);
}

bool dmesh_module_loader_refresh_header(void)
{
    if (cached_task_running) return false;
    if (cached_partition == NULL) cached_partition = resolve_module_partition();
    cached_header_valid = false;
    cached_offset = 0;
    if (cached_partition == NULL || cached_partition->size < DMESH_MODULE_HEADER_SIZE) {
        return false;
    }
    dmesh_module_header_t candidate;
    const uint32_t offset = 0;
    if (read_module_header(cached_partition, offset, &candidate) != ESP_OK ||
        candidate.magic != DMESH_MODULE_MAGIC ||
        candidate.abi_version != DMESH_MODULE_ABI_VERSION ||
        candidate.header_size != DMESH_MODULE_HEADER_SIZE ||
        candidate.entry_offset < DMESH_MODULE_HEADER_SIZE ||
        candidate.entry_offset % 4u != 0 ||
        candidate.entry_offset >= candidate.image_size ||
        candidate.image_size > cached_partition->size - offset) {
        ESP_LOGW(TAG, "module header refresh rejected after update");
        return false;
    }
    cached_header = candidate;
    cached_offset = offset;
    cached_header_valid = true;
    ESP_LOGI(TAG, "module header refreshed tag=%u entry=0x%08lx image=0x%08lx",
             cached_header.service_tag, (unsigned long)cached_header.entry_offset,
             (unsigned long)cached_header.image_size);
    return true;
}

