costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
bool dmesh_module_loader_header_valid(void) { return cached_header_valid; }
bool dmesh_module_loader_is_lora(void)
{
    return cached_header_valid && cached_header.service_tag == 43u;
}
uint32_t dmesh_module_loader_offset(void) { return cached_offset; }
uint32_t dmesh_module_loader_image_size(void)
{
    return cached_header_valid ? cached_header.image_size : 0;
}
uint32_t dmesh_module_loader_required_stack_words(void)
{
    return cached_header_valid ? cached_header.required_stack_words : 0u;
}

int dmesh_module_lora_configure(const dmesh_lora_config_v1 *config)
{
    if (config == NULL || config->abi_version != DMESH_LORA_ABI_VERSION ||
        config->size < sizeof(dmesh_lora_config_v1)) return -1;
    /* Command handlers call this on every public `lora` operation. Never
     * tear down the SPI device underneath a running module task: the task is
     * using the same host table and a concurrent bus removal can turn a
     * normal tx/stop command into an intermittent I/O failure. A running
     * task consumes the updated immutable configuration on its next command;
     * the critical section keeps the 40-byte ABI copy publication bounded. */
    if (service_running(43u)) {
        portENTER_CRITICAL(&lora_command_mux);
        lora_config = *config;
        portEXIT_CRITICAL(&lora_command_mux);
        return 0;
    }
    if (lora_spi != NULL) {
        spi_bus_remove_device(lora_spi);
        lora_spi = NULL;
        /* Keep teardown's host mapping identical to lora_host_init(): the
         * persisted enum uses 1=SPI2/HSPI and 2=SPI3/VSPI. Freeing the
         * opposite bus leaves the real bus allocated and can make the next
         * module invocation fail or collide with another peripheral. */
        spi_bus_free(lora_spi_host_device());
    }
    lora_config = *config;
    lora_host_init();
    if (lora_spi == NULL) {
        cached_task_done = true;
        cached_last_result = -30;
        return -2;
    }
    return 0;
}
int dmesh_module_lora_update_config(const dmesh_lora_config_v1 *config)
{
    if (config == NULL || config->abi_version != DMESH_LORA_ABI_VERSION ||
        config->size < sizeof(dmesh_lora_config_v1)) return -1;
    if (!service_running(43u)) {
        lora_config = *config;
        return 0;
    }
    /* The persistent task reads this object when it handles a command. Keep
     * the copy serialized with command publication; callers may queue an
     * explicit `reconfigure` when they need the RX registers reapplied. */
    portENTER_CRITICAL(&lora_command_mux);
    lora_config = *config;
    portEXIT_CRITICAL(&lora_command_mux);
    return 0;
}
int dmesh_module_lora_command(const uint8_t *args, size_t args_len,
                              const uint8_t *payload, size_t payload_len)
{
    if (args == NULL || args_len == 0 || args_len > LORA_COMMAND_MAX ||
        payload_len > DMESH_LORA_MAX_PACKET || (payload_len != 0 && payload == NULL)) return -1;
    if (!service_running(43u)) return -21;
    portENTER_CRITICAL(&lora_command_mux);
    if (lora_command_pending) {
        portEXIT_CRITICAL(&lora_command_mux);
        return -20;
    }
    memcpy(lora_command_args, args, args_len);
    if (payload_len != 0) memcpy(lora_command_payload, payload, payload_len);
    lora_command_args_len = args_len;
    lora_command_payload_len = payload_len;
    lora_command_pending = true;
    portEXIT_CRITICAL(&lora_command_mux);
    return 0;
}

bool dmesh_module_loader_prepare_flash(uint32_t timeout_ms)
{
    if (!cached_task_running) return true;
    if (service_running(45u)) dmesh_hw_host_request_stop(true);
    if (service_running(43u)) {
    static const uint8_t stop[] = "stop";
    /* Flash erases disable the instruction cache while the module is mapped
     * from this same raw data region. Replace any queued radio command with a
     * bounded stop request before the TCP worker can touch the partition. */
    portENTER_CRITICAL(&lora_command_mux);
    memcpy(lora_command_args, stop, sizeof(stop) - 1);
    lora_command_args_len = sizeof(stop) - 1;
    lora_command_payload_len = 0;
    lora_command_pending = true;
    portEXIT_CRITICAL(&lora_command_mux);
    }
    TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(timeout_ms);
    while (cached_task_running) {
        if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) return false;
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    return true;
}
bool dmesh_module_loader_task_done(void) { return cached_task_done; }
int dmesh_module_loader_last_result(void) { return cached_last_result; }
uint32_t dmesh_module_loader_runtime_ms(void)
{
    uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);
    if (cached_task_running) return now - cached_task_start_ms;
    return cached_last_runtime_ms;
}
uint32_t dmesh_module_loader_max_runtime_ms(void) { return cached_max_runtime_ms; }
uint32_t dmesh_module_loader_task_runs(void) { return cached_task_runs; }
uint32_t dmesh_module_loader_stack_high_water_words(void)
{
    TaskHandle_t task = cached_task_handle;
    return task == NULL ? cached_last_stack_high_water_words :
        (uint32_t)uxTaskGetStackHighWaterMark(task);
}
uint32_t dmesh_module_loader_stage(void) { return cached_task_stage; }
uint32_t dmesh_module_loader_spi_calls(void) { return cached_spi_calls; }
uint32_t dmesh_module_loader_spi_errors(void) { return cached_spi_errors; }
uint32_t dmesh_module_loader_lora_poll_count(void) { return cached_lora_poll_count; }
uint32_t dmesh_module_loader_lora_irq_wakes(void) { return cached_lora_irq_wakes; }
uint32_t dmesh_module_loader_lora_irq_timeouts(void) { return cached_lora_irq_timeouts; }
uint32_t dmesh_module_loader_last_lora_payload_len(void) { return cached_last_lora_payload_len; }
uint32_t dmesh_module_loader_last_lora_command_len(void) { return cached_last_lora_command_len; }
uint32_t dmesh_module_loader_module_event_calls(void) { return cached_module_event_calls; }
uint32_t dmesh_module_loader_last_module_event_id(void) { return cached_last_module_event_id; }
uint32_t dmesh_module_loader_entry_args_len(void) { return cached_entry_args_len; }
const char *dmesh_module_loader_entry_args(void) { return cached_entry_args; }
const char *dmesh_module_loader_last_lora_command(void) { return cached_last_lora_command; }
uint32_t dmesh_module_loader_flash_connect_attempts(void) { return cached_flash_connect_attempts; }
int32_t dmesh_module_loader_flash_connect_errno(void) { return cached_flash_connect_errno; }
uint16_t dmesh_module_loader_flash_connect_port(void) { return cached_flash_connect_port; }
const char *dmesh_module_loader_flash_connect_host(void) { return cached_flash_connect_host; }

