costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
typedef struct {
    uint16_t service_tag;
    uint16_t reserved;
    uint32_t offset;
    uint32_t size;
    size_t payload_len;
    size_t args_len;
    uint32_t stack_words;
    uint8_t bytes[];
} module_job_t;

static int module_stack_words(uint32_t offset, uint32_t *out)
{
    if (out == NULL || cached_partition == NULL || offset > cached_partition->size ||
        cached_partition->size - offset < sizeof(dmesh_module_header_t)) {
        ESP_LOGE(TAG, "module stack header bounds offset=0x%08lx partition=%p address=0x%08lx size=0x%08lx",
                 (unsigned long)offset, (void *)cached_partition,
                 cached_partition != NULL ? (unsigned long)cached_partition->address : 0ul,
                 cached_partition != NULL ? (unsigned long)cached_partition->size : 0ul);
        return -1;
    }
    dmesh_module_header_t header;
    esp_err_t read_err = read_module_header(cached_partition, offset, &header);
    if (read_err != ESP_OK) {
        ESP_LOGE(TAG, "module stack header read failed offset=0x%08lx address=0x%08lx err=%s",
                 (unsigned long)offset, (unsigned long)cached_partition->address,
                 esp_err_to_name(read_err));
        return -1;
    }
    if (header.magic != DMESH_MODULE_MAGIC || header.abi_version != DMESH_MODULE_ABI_VERSION ||
        header.header_size != DMESH_MODULE_HEADER_SIZE) {
        ESP_LOGE(TAG, "module stack header invalid offset=0x%08lx magic=0x%08lx abi=%u header=%u image=0x%08lx stack=%lu tag=%u",
                 (unsigned long)offset, (unsigned long)header.magic,
                 (unsigned)header.abi_version, (unsigned)header.header_size,
                 (unsigned long)header.image_size, (unsigned long)header.required_stack_words,
                 (unsigned)header.service_tag);
        return -1;
    }
    uint32_t requested = header.required_stack_words;
    if (requested == 0) requested = MODULE_TASK_STACK_DEFAULT;
    if (requested < MODULE_TASK_STACK_MIN) requested = MODULE_TASK_STACK_MIN;
    if (requested > MODULE_TASK_STACK_MAX) return -2;
    *out = requested;
    return 0;
}

static int log_line(void *user, const uint8_t *data, size_t len)
{
    (void)user;
    if (data == NULL) return -1;
    char line[97];
    size_t copied = len < sizeof(line) - 1u ? len : sizeof(line) - 1u;
    memcpy(line, data, copied);
    line[copied] = '\0';
    /* Main normally suppresses INFO logs. Module protocol diagnostics are
     * deliberately WARN-level so a failed asynchronous transfer remains
     * visible through the managed PPP log without reopening raw UART text. */
    ESP_LOGW(TAG, "module log=%s%s", line, copied == len ? "" : "...");
    return copied == len ? 0 : -2;
}

static int call_service(void *user, uint16_t service_tag,
                        const uint8_t *payload, size_t payload_len,
                        uint8_t *response, size_t response_capacity,
                        size_t *response_len, uint32_t timeout_ms)
{
    (void)user;
    if (timeout_ms == 0 || timeout_ms > 250u) timeout_ms = 250u;
    return dmesh_module_call_service(service_tag, payload, payload_len,
                                     response, response_capacity, response_len,
                                     timeout_ms);
}

static dmesh_module_host_v1 common_host = {
    .abi_version = DMESH_MODULE_ABI_VERSION,
    .size = sizeof(dmesh_module_host_v1),
    .features = 0,
    .user = NULL,
    .log_line = log_line,
    .call_service = call_service,
    .get_setting = get_setting,
    .set_setting = set_setting,
    .emit_event = emit_event,
    .hw = &dmesh_hw_host,
    .alloc = module_alloc,
};

static int32_t flash_tcp_connect(void *user, const uint8_t *host,
                                  size_t host_len, uint16_t port)
{
    (void)user;
    if (host == NULL || host_len == 0 || host_len >= 16) {
        ESP_LOGE(TAG, "flash tcp connect invalid host len=%u port=%u",
                 (unsigned)host_len, (unsigned)port);
        return -1;
    }
    char address[16];
    memcpy(address, host, host_len);
    address[host_len] = '\0';
    cached_flash_connect_attempts++;
    cached_flash_connect_port = port;
    memset(cached_flash_connect_host, 0, sizeof(cached_flash_connect_host));
    memcpy(cached_flash_connect_host, address, host_len);
    int fd = socket(AF_INET, SOCK_STREAM, IPPROTO_IP);
    if (fd < 0) {
        cached_flash_connect_errno = errno;
        ESP_LOGE(TAG, "flash tcp socket failed host=%s port=%u errno=%d",
                 address, (unsigned)port, errno);
        return -errno;
    }
    struct sockaddr_in peer = {0};
    peer.sin_family = AF_INET;
    peer.sin_port = htons(port);
    int address_result = inet_pton(AF_INET, address, &peer.sin_addr);
    if (address_result != 1) {
        /* The local Rust object server is the only supported development
         * endpoint.  Never turn malformed input into fd=0; use the fixed AP
         * endpoint explicitly and keep the diagnostic visible. */
        ESP_LOGE(TAG, "flash tcp invalid IPv4 host host=%s len=%u port=%u; using Rust AP",
                 address, (unsigned)host_len, (unsigned)port);
        peer.sin_addr.s_addr = htonl((10u << 24) | (78u << 16) | (0u << 8) | 1u);
    }
    ip4_addr_t route_dest = { .addr = peer.sin_addr.s_addr };
    struct netif *route = ip4_route(&route_dest);
    ESP_LOGW(TAG, "flash tcp route host=%s route=%p default=%p netif=%p flags=0x%02x ip=%08lx mask=%08lx gw=%08lx",
             address, (void *)route, (void *)netif_default,
             route != NULL ? (void *)route : NULL,
             route != NULL ? (unsigned)route->flags : 0u,
             route != NULL ? (unsigned long)route->ip_addr.u_addr.ip4.addr : 0ul,
             route != NULL ? (unsigned long)route->netmask.u_addr.ip4.addr : 0ul,
             route != NULL ? (unsigned long)route->gw.u_addr.ip4.addr : 0ul);
    /* A blocking connect can wait through several lwIP retransmission rounds
     * while the STA has an association but no usable ARP route.  The module
     * task must not become permanently stuck in that state: Main still needs
     * to service UART and report the failure. */
    int original_flags = fcntl(fd, F_GETFL, 0);
    if (original_flags < 0 || fcntl(fd, F_SETFL, original_flags | O_NONBLOCK) != 0) {
        int error = errno;
        cached_flash_connect_errno = error;
        ESP_LOGE(TAG, "flash tcp nonblocking setup failed host=%s port=%u errno=%d",
                 address, (unsigned)port, error);
        close(fd);
        return -error;
    }
    int connect_result = connect(fd, (struct sockaddr *)&peer, sizeof(peer));
    if (connect_result != 0 && errno != EINPROGRESS && errno != EWOULDBLOCK) {
        int error = errno;
        cached_flash_connect_errno = error;
        ESP_LOGE(TAG, "flash tcp connect failed host=%s port=%u errno=%d",
                 address, (unsigned)port, error);
        close(fd);
        return -error;
    }
    if (connect_result != 0) {
        fd_set writable;
        fd_set errors;
        FD_ZERO(&writable);
        FD_ZERO(&errors);
        FD_SET(fd, &writable);
        FD_SET(fd, &errors);
        struct timeval timeout = {.tv_sec = 5, .tv_usec = 0};
        int selected = select(fd + 1, NULL, &writable, &errors, &timeout);
        int socket_error = 0;
        socklen_t socket_error_len = sizeof(socket_error);
        if (selected <= 0 ||
            getsockopt(fd, SOL_SOCKET, SO_ERROR, &socket_error, &socket_error_len) != 0 ||
            socket_error != 0 || FD_ISSET(fd, &errors)) {
            int error = selected == 0 ? ETIMEDOUT :
                (socket_error != 0 ? socket_error : errno);
            cached_flash_connect_errno = error;
            ESP_LOGE(TAG, "flash tcp connect timeout/failure host=%s port=%u errno=%d",
                     address, (unsigned)port, error);
            close(fd);
            return -error;
        }
    }
    if (fcntl(fd, F_SETFL, original_flags) != 0) {
        int error = errno;
        cached_flash_connect_errno = error;
        ESP_LOGE(TAG, "flash tcp restore blocking mode failed host=%s port=%u errno=%d",
                 address, (unsigned)port, error);
        close(fd);
        return -error;
    }
    cached_flash_connect_errno = 0;
    ESP_LOGI(TAG, "flash tcp connected host=%s port=%u fd=%d", address,
             (unsigned)port, fd);
    return fd;
}

static int32_t flash_tcp_set_options(void *user, int32_t fd,
                                     uint32_t recv_buf, uint32_t send_buf,
                                     uint32_t timeout_ms, uint8_t nodelay)
{
    (void)user;
    int value = (int)recv_buf;
    if (recv_buf != 0 && setsockopt(fd, SOL_SOCKET, SO_RCVBUF, &value, sizeof(value)) != 0) return -errno;
    value = (int)send_buf;
    if (send_buf != 0 && setsockopt(fd, SOL_SOCKET, SO_SNDBUF, &value, sizeof(value)) != 0) return -errno;
    if (nodelay) {
        value = 1;
        if (setsockopt(fd, IPPROTO_TCP, TCP_NODELAY, &value, sizeof(value)) != 0) return -errno;
    }
    if (timeout_ms != 0) {
        struct timeval timeout = {.tv_sec = (time_t)(timeout_ms / 1000u),
                                   .tv_usec = (suseconds_t)((timeout_ms % 1000u) * 1000u)};
        if (setsockopt(fd, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout)) != 0) return -errno;
        if (setsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout)) != 0) return -errno;
    }
    return 0;
}

static int32_t flash_tcp_recv(void *user, int32_t fd, uint8_t *data, size_t len,
                              uint32_t timeout_ms)
{
    (void)user;
    /* tcp_set_options() is called once immediately after connect.  Repeating
     * setsockopt(SO_RCVTIMEO) for every header and payload read adds two
     * control calls per DRS2 frame and was measurable on the ESP socket path.
     * Keep the ABI timeout argument for older hosts, but let the socket's
     * already-installed timeout do the work. */
    (void)timeout_ms;
    int result = recv(fd, data, len, 0);
    return result < 0 ? -errno : result;
}

static int32_t flash_tcp_send(void *user, int32_t fd, const uint8_t *data, size_t len)
{
    (void)user;
    int result = send(fd, data, len, 0);
    return result < 0 ? -errno : result;
}

static int32_t flash_tcp_close(void *user, int32_t fd)
{
    (void)user;
    return close(fd) == 0 ? 0 : -errno;
}

static int32_t flash_erase(void *user, uint32_t address, uint32_t length)
{
    (void)user;
    esp_err_t error = esp_flash_erase_region(esp_flash_default_chip, address, length);
    return error == ESP_OK ? 0 : -(int32_t)error;
}

static int32_t flash_write(void *user, uint32_t address, const uint8_t *data, size_t length)
{
    (void)user;
    esp_err_t error = esp_flash_write(esp_flash_default_chip, data, address, length);
    return error == ESP_OK ? 0 : -(int32_t)error;
}

uint32_t dmesh_module_loader_partition_size(void)
{
    return cached_partition == NULL ? 0 : cached_partition->size;
}

int dmesh_module_loader_flash_erase(uint32_t address, uint32_t length)
{
    if (cached_partition == NULL || address > cached_partition->size ||
        length > cached_partition->size - address ||
        (address & 0xfffu) != 0 || (length & 0xfffu) != 0) return -1;
    return flash_erase(NULL, cached_partition->address + address, length);
}

int dmesh_module_loader_flash_write(uint32_t address, const uint8_t *data,
                                    size_t length)
{
    if (cached_partition == NULL || data == NULL || address > cached_partition->size ||
        length > cached_partition->size - address) return -1;
    return flash_write(NULL, cached_partition->address + address, data, length);
}

