costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
static const esp_partition_t *dmesh_main_partition(void)
{
    return esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                    ESP_PARTITION_SUBTYPE_ANY, "main");
}

int dmesh_main_flash_erase(uint32_t length)
{
    const esp_partition_t *partition = dmesh_main_partition();
    if (partition == NULL || length == 0 || length > partition->size) return -1;
    uint32_t erase = (length + 0xfffu) & ~0xfffu;
    return esp_partition_erase_range(partition, 0, erase);
}

int dmesh_main_flash_write(uint32_t offset, const uint8_t *data, size_t length)
{
    const esp_partition_t *partition = dmesh_main_partition();
    if (partition == NULL || data == NULL || offset > partition->size ||
        length > partition->size - offset) return -1;
    return esp_partition_write(partition, offset, data, length);
}

static uint64_t flash_now_ms(void *user)
{
    (void)user;
    return (uint64_t)(esp_timer_get_time() / 1000);
}

static const dmesh_flash_host_v1 flash_host = {
    .abi_version = DMESH_FLASH_HOST_ABI_VERSION,
    .size = sizeof(dmesh_flash_host_v1),
    .features = DMESH_FLASH_HOST_FEATURE_TCP | DMESH_FLASH_HOST_FEATURE_FLASH_WRITE |
                DMESH_FLASH_HOST_FEATURE_DRY_RUN,
    .user = NULL,
    .tcp_connect = flash_tcp_connect,
    .tcp_set_options = flash_tcp_set_options,
    .tcp_recv = flash_tcp_recv,
    .tcp_send = flash_tcp_send,
    .tcp_close = flash_tcp_close,
    .flash_erase = flash_erase,
    .flash_write = flash_write,
    .now_ms = flash_now_ms,
};

bool dmesh_module_flash_supported(void)
{
    return true;
}

bool dmesh_module_psram_exec_supported(void)
{
    /* A heap allocation in PSRAM is data-addressable, not a portable dynamic
     * instruction mapping. S2/S3 XiP is an image/linker configuration, and
     * classic ESP32 does not provide this experiment with executable PSRAM. */
    return false;
}

const char *dmesh_module_psram_exec_reason(void)
{
    return "dynamic PSRAM execution is unsupported; use flash instruction mmap";
}

static int invoke_now(uint16_t expected_service_tag, uint32_t offset, uint32_t size,
                      const uint8_t *payload, size_t payload_len,
                      const uint8_t *args, size_t args_len)
{
    module_arena_reset();
    cached_task_stage = 3;
    if (offset % MODULE_ALIGN != 0) return -1;
    const esp_partition_t *partition = cached_partition;
    if (partition == NULL || offset > partition->size ||
        partition->size - offset < DMESH_MODULE_HEADER_SIZE) return -2;

    /* The startup scan caches the preferred module (currently lora), but a
     * generic module command may explicitly target any aligned slot. Read
     * that slot's header instead of requiring it to be the cached one. */
    dmesh_module_header_t selected_header;
    esp_err_t read_err = read_module_header(partition, offset, &selected_header);
    if (read_err != ESP_OK) return -3;
    const dmesh_module_header_t *header = &selected_header;
    if (size == 0) size = partition->size - offset;
    if (size > partition->size - offset) return -2;
    if (header->magic != DMESH_MODULE_MAGIC ||
        header->abi_version != DMESH_MODULE_ABI_VERSION ||
        header->header_size != DMESH_MODULE_HEADER_SIZE ||
        header->image_size < DMESH_MODULE_HEADER_SIZE ||
        header->entry_offset < DMESH_MODULE_HEADER_SIZE ||
        header->entry_offset % 4u != 0 ||
        header->entry_offset >= header->image_size ||
        header->image_size > size) return -4;
    if (!header_service_window(header, expected_service_tag, offset,
                               partition->size)) return -5;

    const void *mapped = NULL;
    esp_partition_mmap_handle_t handle = 0;
    uint32_t fixed_mapped_size = 0;
    bool fixed_mapping = false;
    esp_err_t err;
#if defined(MODULE_FIXED_VADDR)
    if ((header->flags & DMESH_MODULE_FLAG_FIXED_VMA) != 0) {
        err = map_fixed_module(partition, offset, header->image_size,
                               (const uint8_t **)&mapped, &fixed_mapped_size,
                               header->code_vma, header->data_vma);
        fixed_mapping = err == ESP_OK;
    } else
#endif
    {
        err = esp_partition_mmap(partition, offset, header->image_size,
                                  ESP_PARTITION_MMAP_INST, &mapped, &handle);
    }
    if (err != ESP_OK || mapped == NULL) return -3;
    ESP_LOGI(TAG, "map base=%p fixed=%s size=%lu magic=0x%08lx abi=%u header=%u entry=0x%08lx image=0x%08lx",
             mapped, fixed_mapping ? "true" : "false", (unsigned long)size,
             (unsigned long)header->magic,
             (unsigned)header->abi_version, (unsigned)header->header_size,
             (unsigned long)header->entry_offset, (unsigned long)header->image_size);
    int result = -4;
    bool header_matches = header->magic == DMESH_MODULE_MAGIC &&
        header->abi_version == DMESH_MODULE_ABI_VERSION &&
        header->header_size == DMESH_MODULE_HEADER_SIZE &&
        header->service_tag == expected_service_tag &&
        header_service_window(header, expected_service_tag, offset, partition->size) &&
        header->entry_offset >= DMESH_MODULE_HEADER_SIZE &&
        header->entry_offset % 4u == 0 &&
        header->entry_offset < header->image_size && header->image_size <= size;
    if (header_matches) {
        cached_task_stage = 4;
        const uint8_t *base = mapped;
        dmesh_module_entry_fn entry = (dmesh_module_entry_fn)(base + header->entry_offset);
        ESP_LOGI(TAG, "invoke entry=%p context_size=%u payload=%lu args=%lu",
                 (void *)entry, (unsigned)sizeof(dmesh_module_context_t),
                 (unsigned long)payload_len, (unsigned long)args_len);
        cached_entry_args_len = (uint32_t)args_len;
        memset(cached_entry_args, 0, sizeof(cached_entry_args));
        size_t entry_copy = args_len < sizeof(cached_entry_args) - 1u
            ? args_len : sizeof(cached_entry_args) - 1u;
        if (args != NULL && entry_copy != 0) memcpy(cached_entry_args, args, entry_copy);
        dmesh_module_context_t context = {
            .abi_version = DMESH_MODULE_ABI_VERSION, .size = sizeof(context),
            .user = NULL, .log_line = log_line, .call_service = call_service,
            .get_setting = get_setting, .set_setting = set_setting,
            .emit_event = emit_event,
            .lora_host = &lora_host,
            .lora_config = &lora_config,
            .host = &common_host,
            .flash_host = &flash_host,
        };
        result = entry(&context, payload, payload_len, args, args_len);
    } else {
        ESP_LOGE(TAG, "module validation rejected expected_tag=%u actual_tag=%u magic=0x%08lx abi=%u header=%u entry=0x%08lx image=0x%08lx bound=0x%08lx fixed_flag=%s",
                 (unsigned)expected_service_tag, (unsigned)header->service_tag,
                 (unsigned long)header->magic, (unsigned)header->abi_version,
                 (unsigned)header->header_size, (unsigned long)header->entry_offset,
                 (unsigned long)header->image_size, (unsigned long)size,
                 (header->flags & DMESH_MODULE_FLAG_FIXED_VMA) != 0 ? "true" : "false");
    }
    if (fixed_mapping) {
#if defined(MODULE_FIXED_VADDR)
        unmap_fixed_module(fixed_mapped_size, header->code_vma, header->data_vma);
#endif
    } else {
        esp_partition_munmap(handle);
    }
    module_arena_reset();
    return result;
}

static void module_task(void *arg)
{
    module_job_t *job = arg;
    cached_task_stage = 1;
    ESP_LOGI(TAG, "module task enter tag=%u payload=%u args=%u",
             (unsigned)job->service_tag, (unsigned)job->payload_len,
             (unsigned)job->args_len);
    /* A completed Recovery handoff may leave the shared stop flag set while
     * this task is being queued. Clear only that stale request at the task
     * boundary; later flash preparation still stops the running task. */
    if (job->service_tag == 45u) dmesh_hw_host_request_stop(false);
    if (job->service_tag == 43u) dmesh_lora_irq_set_task(xTaskGetCurrentTaskHandle());
    const uint8_t *payload = job->bytes;
    const uint8_t *args = job->bytes + job->payload_len;
    uint32_t started_ms = (uint32_t)(esp_timer_get_time() / 1000);
    cached_task_start_ms = started_ms;
    cached_task_runs++;
    cached_task_stage = 2;
    int result = invoke_now(job->service_tag, job->offset, job->size, payload, job->payload_len,
                            args, job->args_len);
    cached_task_stage = 5;
    ESP_LOGI(TAG, "module task invoke returned result=%d", result);
    uint32_t elapsed_ms = (uint32_t)(esp_timer_get_time() / 1000) - started_ms;
    cached_last_runtime_ms = elapsed_ms;
    if (elapsed_ms > cached_max_runtime_ms) cached_max_runtime_ms = elapsed_ms;
    cached_last_result = result;
    cached_last_stack_high_water_words =
        (uint32_t)uxTaskGetStackHighWaterMark(xTaskGetCurrentTaskHandle());
    cached_task_done = true;
    cached_task_stage = 8;
    service_set_running(job->service_tag, false);
    if (job->service_tag == 43u) dmesh_lora_irq_set_task(NULL);
    cached_task_handle = NULL;
    memset(cached_task_name, 0, sizeof(cached_task_name));
    cached_task_service_tag = 0;
    if (result <= -100) {
        ESP_LOGE(TAG, "module entry rejected ABI/host contract offset=0x%08lx result=%d; task exited safely",
                 (unsigned long)job->offset, result);
    } else {
        ESP_LOGI(TAG, "module task complete offset=0x%08lx result=%d",
                 (unsigned long)job->offset, result);
    }
    free(job);
    vTaskDelete(NULL);
}

