costinm/dmesh/fw/esp32/rust/native/dmesh_module_loader/dmesh_module_loader.c
int dmesh_module_start_service(uint16_t service_tag, uint32_t offset, uint32_t size,
                            const uint8_t *payload, size_t payload_len,
                            const uint8_t *args, size_t args_len)
{
    /* Keep each ABI rejection distinct: the Rust caller receives this code in
     * its command response and cannot otherwise diagnose an asynchronous task
     * start failure over NAN. */
    uint32_t expected_offset = 0;
    if (!service_tag_offset(service_tag, &expected_offset)) return -11;
    if (offset != expected_offset) return -12;
    if (service_running(service_tag)) return -19;
    if (payload_len > MODULE_MAX_ARGUMENTS) return -14;
    if (args_len > MODULE_MAX_ARGUMENTS) return -15;
    if (payload_len + args_len > MODULE_MAX_ARGUMENTS) return -16;
    if (payload_len != 0 && payload == NULL) return -17;
    if (args_len != 0 && args == NULL) return -18;
    uint32_t stack_words = 0;
    int stack_rc = module_stack_words(offset, &stack_words);
    if (stack_rc != 0) return stack_rc == -2 ? -22 : -23;
    module_job_t *job = malloc(sizeof(*job) + payload_len + args_len);
    if (job == NULL) return -2;
    job->service_tag = service_tag;
    job->reserved = 0;
    job->offset = offset; job->size = size;
    job->payload_len = payload_len; job->args_len = args_len;
    if (payload_len != 0) memcpy(job->bytes, payload, payload_len);
    if (args_len != 0) memcpy(job->bytes + payload_len, args, args_len);
    cached_task_done = false;
    cached_last_result = -999;
    cached_task_start_ms = (uint32_t)(esp_timer_get_time() / 1000);
    service_set_running(service_tag, true);
    cached_task_service_tag = service_tag;
    snprintf(cached_task_name, sizeof(cached_task_name), "tag-%u", (unsigned)service_tag);
    if (service_tag == 45u) dmesh_hw_host_request_stop(false);
    job->stack_words = stack_words;
    /* Module code must not starve Main's UART/control task if an IRQ or SPI
     * callback returns immediately. Keep it at the cooperative application
     * priority; the host wait callback supplies the normal event wakeup. */
    if (xTaskCreatePinnedToCore(module_task, "dmesh_mod", job->stack_words,
                                job, MODULE_TASK_PRIORITY, &cached_task_handle,
                                tskNO_AFFINITY) != pdPASS) {
        service_set_running(service_tag, false);
        cached_task_done = true;
        cached_task_handle = NULL;
        free(job);
        return -3;
    }
    return 0;
}

/* Transitional host-side alias. The device runtime is numeric; this wrapper
 * is retained only while Main and the flash command surface migrate. */
int dmesh_module_start_task(const char *name, uint32_t offset, uint32_t size,
                            const uint8_t *payload, size_t payload_len,
                            const uint8_t *args, size_t args_len)
{
    if (name == NULL) return -11;
    uint16_t tag = 0;
    if (strcmp(name, "lora") == 0) tag = 43;
    else if (strcmp(name, "hw") == 0) tag = 45;
    else if (strcmp(name, "hello") == 0) tag = 46;
    else return -12;
    return dmesh_module_start_service(tag, offset, size, payload, payload_len,
                                      args, args_len);
}
